## NAME : ANSH PUJARA
## AI-ML BATCH 1
## DAY 12 ASSIGNMENT

### 1. Wilcoxon Test

In [1]:
import pandas as pd
from scipy.stats import wilcoxon

In [9]:
data = pd.read_excel("Wilcoxon.xlsx", sheet_name=0)
data.head()

   ID  TRT  AGE  WEIGHIN  STAGE  TOTALCIN  TOTALCW2  TOTALCW4 TOTALCW6
0   1    0   52    124.0      2         6         6         6        7
1   5    0   77    160.0      1         9         6        10        9
2   6    0   60    136.5      4         7         9        17       19
3   9    0   61    179.6      1         6         7         9        3
4  11    0   59    175.8      2         6         7        16       13

In [10]:
d1=data.TOTALCIN
d2=data.TOTALCW2
stat, p=wilcoxon(d1,d2)

In [11]:
print(stat, p)

29.5 0.00259741456482452

###  2. Friedmann Chi-sq test

In [12]:
from scipy.stats import friedmanchisquare
d3 = data.TOTALCW4
stat, p = friedmanchisquare(d1, d2, d3)
print(stat, p)

27.927710843373504 8.62133745016363e-07

In [8]:
data.head()

     ids  Gender        Smoking
0  43783  Female      NonSmoker
1  20278  Female      NonSmoker
2  20389  Female      NonSmoker
3  22820    Male            NaN
4  24559    Male  CurrentSmoker

### 3. Mann - Whitney Test

In [14]:
from scipy.stats import mannwhitneyu
dataset1=pd.read_excel("3 Mann Whitney.xlsx",sheet_name=1)
dataset1.head()

   Design1  Design2
0       11       12
1       17       10
2       16       15
3       14       19
4       15       11

In [15]:
a1 = dataset1.Design1
a2 = dataset1.Design2
stat, p = mannwhitneyu(a1, a2)

In [16]:
print(stat, p)

9.0 0.2641796636354743

### 4. Kruskal - Wallis Test

In [18]:
from scipy.stats import kruskal

dataset2=pd.read_excel("4 Kruskal Wallis.xlsx",sheet_name=0)

dataset2.head()

   Design1  Design2  Design3  Showroom
0       11       12       23         1
1       17       10       20         2
2       16       15       18         3
3       14       19       17         4
4       15       11       10         5

In [19]:
b1, b2, b3 = dataset2.Design1, dataset2.Design2, dataset2.Design3

In [20]:
stat, p =kruskal(b1, b2, b3)

In [21]:
print(stat, p)

2.7345323741007226 0.25480259087913626

### 5. One Sample t-test

In [23]:
from scipy.stats import ttest_1samp
data = pd.read_excel("OneSample.xlsx", sheet_name=0)
data.head()

     ids  Height
0  43783   72.35
1  20278   70.66
2  20389   70.68
3  24559   67.43
4  28980   68.45

In [25]:
h1 = data.Height
stat, p = ttest_1samp(h1, 65)
print(stat, p)

11.498800238580099 1.087893570160242e-26

### 6. Paired t-test

In [26]:
from scipy.stats import ttest_rel
data = pd.read_excel("2. Paired Sample.xlsx", sheet_name=0)
data.head()

     ids  English   Math
0  43783    88.24  60.02
1  20278    89.45  70.19
2  20389    96.73  71.20
3  22820    74.06  55.89
4  24559    82.61  65.52

In [27]:
d1, d2 = data.English, data.Math
stat, p = ttest_rel(d1, d2)
print(stat, p)

36.312568981719856 3.0710987192210606e-128

### 7. Independent t-test

In [28]:
from scipy.stats import ttest_ind
data = pd.read_excel("3. Independent Sample.xlsx", sheet_name=0)
data.head()

     ids  Athlete       MileMinDur
0  20278        0  00:06:21.250000
1  20389        0  00:07:00.967000
2  22820        0  00:12:44.740000
3  24559        1  00:06:25.506000
4  28980        1  00:07:24.585000

In [29]:
p1, p2 = data.Athlete, data.MileMinDur

In [ ]:
stat, p = ttest_ind(p1, p2)